ExchangePlans/bitmobile_ОбменСУчетнымиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<ExchangePlan>
		<Properties>
			<Name>bitmobile_ОбменСУчетнымиСистемами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПравилаОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTP_Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTP_Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTP_Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FTP_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диск_Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_ТипИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_ИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_АутентификацияWindows</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеПодключение_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/bitmobile_ОбменСУчетнымиСистемами/Forms/ФормаУзла/Ext/Form/Module.bsl
/////////////////////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = ПланыОбмена.bitmobile_ОбменСУчетнымиСистемами.ЭтотУзел() Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
		Элементы.ЗагрузитьПравила.Доступность = Ложь;
		
	КонецЕсли;
	
	Если Объект.ПрямоеПодключение_ТипИБ Тогда
		
		Элементы.ПрямоеПодключение_ИмяСервера.Доступность	= Ложь;
		Элементы.ПрямоеПодключение_ИБ.Доступность			= Ложь;
		Элементы.ПрямоеПодключение_Каталог.Доступность		= Истина;
		
	Иначе
		
		Элементы.ПрямоеПодключение_ИмяСервера.Доступность	= Истина;
		Элементы.ПрямоеПодключение_ИБ.Доступность			= Истина;
		Элементы.ПрямоеПодключение_Каталог.Доступность		= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АдресФайла) Тогда
		
		ТекущийОбъект.ПравилаОбмена = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоединениеСервер()
	
	ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	
	ОбработкаОбмена.ТипИнформационнойБазыДляПодключения							= Объект.ПрямоеПодключение_ТипИБ;
	ОбработкаОбмена.АутентификацияWindowsИнформационнойБазыДляПодключения		= Объект.ПрямоеПодключение_АутентификацияWindows;
	ОбработкаОбмена.КаталогИнформационнойБазыДляПодключения						= Объект.ПрямоеПодключение_Каталог;
	ОбработкаОбмена.ИмяСервераИнформационнойБазыДляПодключения					= Объект.ПрямоеПодключение_ИмяСервера;
	ОбработкаОбмена.ИмяИнформационнойБазыНаСервереДляПодключения				= Объект.ПрямоеПодключение_ИБ;
	ОбработкаОбмена.ПользовательИнформационнойБазыДляПодключения				= Объект.ПрямоеПодключение_Пользователь;
	ОбработкаОбмена.ПарольИнформационнойБазыДляПодключения						= Объект.ПрямоеПодключение_Пароль;
	ОбработкаОбмена.ВерсияПлатформыИнформационнойБазыДляПодключения				= Объект.ПрямоеПодключение_ВерсияПлатформы;
	
	Если Не ОбработкаОбмена.ВыполнитьПодключениеКИБПриемнику() = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("en='The connection is successfully established.';ru='Подключение успешно установлено.';cz='The connection is successfully established.'");
		Сообщение.Сообщить();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("en='Connection failed.';ru='Подключение не выполнено.';cz='Připojení selhalo.'");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////
// Командный интерфейс

&НаКлиенте
Процедура ЗагрузитьПравила(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьПравилаОкончание", ЭтаФорма)
						,
						,
						, Истина
						, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравилаОкончание(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		
		Возврат;
		
	КонецЕсли;
	
	АдресФайла = Адрес;
	
КонецПроцедуры

&НаКлиенте
Процедура Диск_КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если Не ВебКлиент Тогда
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = НСтр("en='Choose a directory';ru='Выберите каталог';cz='Zvolte složku'");
	ДиалогВыбораФайла.Каталог = Объект.Диск_Каталог;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		Объект.Диск_Каталог = ДиалогВыбораФайла.Каталог;
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПрямоеПодключение_КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если Не ВебКлиент Тогда
		
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДиалогВыбораФайла.Заголовок = НСтр("en='Choose a directory';ru='Выберите каталог';cz='Zvolte složku'");
	ДиалогВыбораФайла.Каталог = Объект.ПрямоеПодключение_Каталог;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		Объект.ПрямоеПодключение_Каталог = ДиалогВыбораФайла.Каталог;
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПрямоеПодключение_ТипИБПриИзменении(Элемент)
	
	Если Объект.ПрямоеПодключение_ТипИБ Тогда
		
		Элементы.ПрямоеПодключение_ИмяСервера.Доступность	= Ложь;
		Элементы.ПрямоеПодключение_ИБ.Доступность			= Ложь;
		Элементы.ПрямоеПодключение_Каталог.Доступность		= Истина;
		
	Иначе
		
		Элементы.ПрямоеПодключение_ИмяСервера.Доступность	= Истина;
		Элементы.ПрямоеПодключение_ИБ.Доступность			= Истина;
		Элементы.ПрямоеПодключение_Каталог.Доступность		= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	
	ПроверитьСоединениеСервер();
	
КонецПроцедуры
